wso2/iskm-bizops/scripts/serviceProviders/BOF_portal.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://org.apache.axis2/xsd" xmlns:xsd1="http://model.common.application.identity.carbon.wso2.org/xsd" xmlns:xsd2="http://script.model.common.application.identity.carbon.wso2.org/xsd">
   <soap:Header/>
   <soap:Body>
      <xsd:createApplication>
         <xsd:serviceProvider>
            <xsd1:applicationName>BOF_portal</xsd1:applicationName>            
            <xsd1:certificateContent></xsd1:certificateContent>            
            <xsd1:description>Authentication service provider for BOF portal</xsd1:description>
            <xsd1:owner>
               <xsd1:tenantDomain>carbon.super</xsd1:tenantDomain>
               <xsd1:userName>admin</xsd1:userName>
               <xsd1:userStoreDomain>PRIMARY</xsd1:userStoreDomain>
            </xsd1:owner>
            <xsd1:permissionAndRoleConfig/>
            <xsd1:saasApp>false</xsd1:saasApp>
            <xsd1:spProperties>
               <xsd1:displayName>DOMAIN_IN_ROLES</xsd1:displayName>
               <xsd1:name>USE_DOMAIN_IN_RULES</xsd1:name>
               <xsd1:value>true</xsd1:value>
            </xsd1:spProperties>
         </xsd:serviceProvider>
      </xsd:createApplication>
   </soap:Body>
</soap:Envelope>